# Rankine Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..Rankine Property
UnitTypeId Class See Also
---
Rankine.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Rankine { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Rankine As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Rankine {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace